package com.power.platform.zdw.type;

/**
 * 
 * class: CodeTypeEnum <br>
 * description: 验证码类型枚举类. <br>
 * author: Roy <br>
 * date: 2019年6月21日 下午6:21:49
 */
public enum CodeTypeEnum {

	/**
	 * 
	 */
	CODE_TYPE_8003("8003", "5位纯字母"),
	/**
	 * 
	 */
	CODE_TYPE_1001("1001", "1位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1002("1002", "2位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1003("1003", "3位英数混合"),
	/**
	 * 4位英数混合.
	 */
	CODE_TYPE_1004("1004", "4位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1005("1005", "5位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1006("1006", "6位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1007("1007", "7位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1008("1008", "8位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1009("1009", "9位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1010("1010", "10位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1011("1011", "11位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1012("1012", "12位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1013("1013", "13位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1014("1014", "14位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1015("1015", "15位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1016("1016", "16位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1017("1017", "17位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1018("1018", "18位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1019("1019", "19位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_1020("1020", "20位英数混合"),
	/**
	 * 
	 */
	CODE_TYPE_2001("2001", "1位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_2002("2002", "2位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_2003("2003", "3位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_2004("2004", "4位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_2005("2005", "5位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_2006("2006", "6位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_2007("2007", "7位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_2008("2008", "8位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_2009("2009", "9位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_2010("2010", "10位汉字"),
	/**
	 * 
	 */
	CODE_TYPE_3001("3001", "1位英文字"),
	/**
	 * 
	 */
	CODE_TYPE_3002("3002", "2位纯英文"),
	/**
	 * 
	 */
	CODE_TYPE_3003("3003", "3位纯英文"),
	/**
	 * 
	 */
	CODE_TYPE_3004("3004", "4位纯英文"),
	/**
	 * 
	 */
	CODE_TYPE_3005("3005", "5位纯英文"),
	/**
	 * 
	 */
	CODE_TYPE_3006("3006", "6位纯英文"),
	/**
	 * 
	 */
	CODE_TYPE_3007("3007", "7位纯英文"),
	/**
	 * 
	 */
	CODE_TYPE_3008("3008", "8位纯英文"),
	/**
	 * 
	 */
	CODE_TYPE_3009("3009", "9位纯英文"),
	/**
	 * 
	 */
	CODE_TYPE_3010("3010", "10位纯英文"),
	/**
	 * 
	 */
	CODE_TYPE_4001("4001", "1位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_4002("4002", "2位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_4003("4003", "3位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_4004("4004", "4位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_4005("4005", "5位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_4006("4006", "6位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_4007("4007", "7位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_4008("4008", "8位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_4009("4009", "9位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_4010("4010", "10位纯数字"),
	/**
	 * 
	 */
	CODE_TYPE_5001("5001", "1位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5002("5002", "2位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5003("5003", "3位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5004("5004", "4位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5005("5005", "5位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5006("5006", "6位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5007("5007", "7位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5008("5008", "8位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5009("5009", "9位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5010("5010", "10位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5011("5011", "11位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5012("5012", "12位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5013("5013", "13位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5014("5014", "14位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5015("5015", "15位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5016("5016", "16位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5017("5017", "17位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5018("5018", "18位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5019("5019", "19位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_5020("5020", "20位中英文数字混合"),
	/**
	 * 
	 */
	CODE_TYPE_6001("6001", "计算题,返还数字结果"),
	/**
	 * 
	 */
	CODE_TYPE_7001("7001", "坐标题(返还1次坐标,适用于4选1,N选1)"),
	/**
	 * 
	 */
	CODE_TYPE_7002("7002", "坐标题(返还2次坐标,适用于N选2）"),
	/**
	 * 
	 */
	CODE_TYPE_7003("7003", "坐标题(返还3次坐标,适用于N选3）"),
	/**
	 * 
	 */
	CODE_TYPE_7004("7004", "坐标题(返还4次坐标,适用于九宫格,N选4）"),
	/**
	 * 
	 */
	CODE_TYPE_9001("9001", "九宫格专用,返还对应汉字数字编号"),
	/**
	 * 
	 */
	CODE_TYPE_6135("6135", "六宫格中返回相同两个字对应的数字编号");

	private CodeTypeEnum(String value, String text) {

		this.value = value;
		this.text = text;
	}

	private String value;
	private String text;

	public String getValue() {

		return value;
	}

	public void setValue(String value) {

		this.value = value;
	}

	public String getText() {

		return text;
	}

	public void setText(String text) {

		this.text = text;
	}

}
